{"sections":{"main":{"type":"page-faqs","blocks":{"accordion-1":{"type":"accordion","settings":{"title":"What is Herbobuild?","content":"<p>Herbobuild is an ayurvedic formulation that is specifically designed to enhance muscle mass and strength naturally. This supplement contains a blend of 3 herbs that have proven benefits in terms of physical performance, cardio-respiratory endurance, smooth muscle relaxation, and thyroid function. What’s unique about Herbobuild is that it helps athletes, bodybuilders, and fitness buffs achieve their goals naturally, without any need for conventional supplements.<\/p>","open":true}},"accordion-2":{"type":"accordion","settings":{"title":"What are the ingredients in the product?","content":"<p><strong>Ashwagandha:<\/strong>An important rasayana, Ashwagandha has been proven to lower cortisol levels, while raising testosterone to improve performance, muscle growth, strength, and cardiorespiratory function.<\/p><p><strong>Safed Museli:<\/strong>An important herb for bodybuilders, Safed Museli naturally raises levels of the human growth hormone, which enhances both muscle growth and tissue repair.<br\/><strong>Shatavari:<\/strong>This rejuvenative herb contains steroidal saponins that boost testosterone, which aids muscle growth. It also contains asparagine, among other nutrients that aid protein synthesis, fueling muscle growth and athletic performance.<br\/><strong>Gokshura:<\/strong>This potent herb has proven to improve blood circulation in users, allowing athletes to maximize their performance gains in a shorter timeframe. When taken with Ashwagandha and Shatavari, it can enhance stamina and recovery.<br\/><strong>Methi Seeds:<\/strong>This ingredient has several health benefits but when it comes to bodybuilding, it’s capable of elevating your body’s testosterone levels. This is done by furostanolic saponins in the seeds that stimulate testosterone production while boosting muscle strength.<br\/><strong>Kaunch Beej:<\/strong> Herbobuild makes use of Kaunch beej to allow the body to produce more testosterone naturally. It makes use of the component L-dopa to stimulate the pituitary gland to produce more LH and testosterone.<\/p>","open":false}},"accordion-3":{"type":"accordion","settings":{"title":"How is the new HerboBuild different from existing one?","content":"<p>New HerboBuild contains six Ayurvedic herbs. In addition to the existing ingredients- Ashwagandha, Safed Musli, and Shatavari, new formulation also has Gokhru, Methi seed (Fenugreek), and Kauch beej. We have increased Ashwagandha concentration from 180 mg\/capsule to 200 mg\/capsule. Shwet Musli and Shatavari concentrations are changed from 180 mg\/capsule to 100 mg\/capsule. Each capsule of New Herbobuild contains 75 mg of Gokhru and 50 mg each of Methi and Kauch beej.<\/p><p>This is more efficacious.<\/p>","open":false}},"accordion-4":{"type":"accordion","settings":{"title":"What are the key ingredient changes in the new HerboBuild?","content":"<p>Dr. Vaidya’s HerboBuild is an Ayurvedic supplement for gaining muscles and improving stamina. The existing formulation contains three ingredients Ashwagandha, Safed Musli, and Shatavari (180 mg each). To make it more efficacious and meet evolving customer needs we have reformulated the product. While keeping these three ingredients in the new formulation, we have added standardized extracts of Gokhru, Methi, and Kauch beej. These are well-known for their benefits in muscle building.<\/p><p>So, this new combination of six herbs can be more beneficial in gaining muscles and improving stamina.<\/p>","open":false}},"accordion-5":{"type":"accordion","settings":{"title":"Do these changes make HerboBuild more effective?","content":"<p>Addition of three new ingredients makes the product more efficacious. Gokhru is well-known for enhancing muscle growth. It ensures proper blood supply to muscles during exercises or physical activities and improves stamina and athletic performance. It also supports post-workout recovery. Methi reduces body fat and promotes lean muscle mass. Many scientific studies have shown that Methi or Fenugreek supplementation helps to increase muscle mass and strength. Kauch beej increases testosterone levels. Its combination with Safed Musli has shown to be effective in increasing GH levels. An increase in levels can boost muscle building.<\/p><p>Therefore, the new HerboBuild formulation can be more beneficial in muscle gaining. <\/p>","open":false}},"849a0563-c52a-462a-a61b-8fcee6c433a6":{"type":"accordion","settings":{"title":"Does the product have any side effects?","content":"<p>The product is 100% natural and does not have any known side effects, if consumed in the correct dosage format.<\/p>","open":false}},"5f69d75d-f82c-4dc9-992d-4de9f53f9cb4":{"type":"accordion","settings":{"title":"When will I see results?","content":"<p>It depends on one’s diet and exercise. A high calorie and high protein diet is recommended to achieve optimum results.<\/p>","open":false}},"e6ca31dd-2050-4c5b-96a4-0b41077b9ab8":{"type":"accordion","settings":{"title":"What are the benefits of the product?","content":"<p>It helps in building muscle and to get the most out of your workout. With Herbobuild, bodybuilders and athletes can get a much needed natural boost to improve performance, endurance, strength and muscle mass.<\/p>","open":false}},"62c793d0-e949-4551-9756-dc7039ee144d":{"type":"accordion","settings":{"title":"What is the new dosage?","content":"<p>Dose of the existing HerboBuild is one capsule twice daily after meals. The recommended dose of the new HerboBuild is one to two capsules per day with milk or water. Muscle gaining is a slow process. To get the maximum benefits, we suggest taking HerboBuild regularly for a minimum of three months.<\/p>","open":false}},"a921d4ed-ab65-4314-a6d8-90cedce03833":{"type":"accordion","settings":{"title":"What should I do along with this product for best results?","content":"<p>Building muscles is a slow process. It requires dedication, discipline, and appropriate changes in the diet and lifestyle with regular use of supplements to achieve the goal.<\/p><p>Take a calorie surplus diet with the right mix of Proteins, Carbohydrates, and Fats in the diet.  Include Cereal, Beans, Legumes, Lentils, Soy products like soy milk and soy protein powder, Nuts and nut butter, fresh fruits like apple, banana, Eggs, Cow’s milk, Cheese, Yoghurt in the diet. Keep yourself hydrated.<\/p><p>Do regular exercises based on your needs and time availability. Keep a training journal to track and measure your progress. Get between 7 to 9 hours of sleep every night to relax muscles.<\/p>","open":false}},"bf08d58c-f841-4117-811c-8dc5db14d48a":{"type":"accordion","settings":{"title":"Is the new HerboBuild safe for long-term use?","content":"<p>HerboBuild is an all-natural product made from standardized herbal extracts.  It does not contain any steroids, protein powders, or other chemically synthesized alternatives. It is safe for vital body organs like the liver and kidneys. All these make it safe for long term use.   <\/p>","open":false}},"2bb96483-c17c-462b-b986-bb9b9c45a0ef":{"type":"accordion","settings":{"title":"What are the additional benefits of the product?","content":"<p>HerboBuild contains rejuvenating herbs like Ashwagandha, Safed Musli, Shatavari, Gokhru, and Kaunch beej. These herbs improve your stamina and endurance, decrease fatigue, and make you feel energetic.  HerboBuild ingredients like Ashwagandha, Gokhru, and Methi (Fenugreek) can help in controlling blood sugar and cholesterol levels. HerboBuild can reduce pain and inflammation of the joints.<\/p>","open":false}},"24be2b2e-fefa-4123-a7bd-5ddb1aa18a17":{"type":"accordion","settings":{"title":"Does Herbobuild helps in boosting male testosterone?","content":"<p>YES! It helps in boosting male testosterone.<\/p>","open":false}},"fa26cfc1-422f-402b-8ddb-19acff8532a8":{"type":"accordion","settings":{"title":"How is it different from protein powder and other Bodybuilding supplement?","content":"<p>Herbobuild is a natural and ayurvedic medicine and has no steroids or protein powder. It does not have any side effect on body organs like liver or kidney which usually get affected by other protein powders and steroids.<br\/>It’s safe for long-term use and dosage can be increased, if required. Please consult an ayurvedic doctor before increasing dosage.<\/p>","open":false}},"747b9623-0ff4-4954-b6a6-1b348e60cc41":{"type":"accordion","settings":{"title":"Can I take this with my other medicines?","content":"<p>Herbs can interact with drugs and alter their efficacy. Therefore, we recommend consulting your physician or Ayurvedic practitioner for better guidance.<\/p>","open":false}},"3b86ac36-4bef-4ecd-b60a-8dda741fbb31":{"type":"accordion","settings":{"title":"Are there any diet restrictions?","content":"<p>Diet plays an important role in muscle gaining. Avoid high sugar foods like candy, cookies, ice cream, or cake. They contain plenty of calories but are low in nutrients. Limit the intake of high-fat foods like high-fat meats, buttery foods, and heavy creams. Avoid carbonated and sugar-sweetened beverages like sparkling water or diet soda. Do not consume deep-fried foods like potato chips, fried fish, french fries, or onion rings.  <\/p>","open":false}},"9d14469a-84cb-410d-b141-00dc42213840":{"type":"accordion","settings":{"title":"What is the recommended course?","content":"<p>Minimum recommended course is 3 months.<\/p>","open":false}}},"block_order":["accordion-1","accordion-2","accordion-3","accordion-4","accordion-5","849a0563-c52a-462a-a61b-8fcee6c433a6","5f69d75d-f82c-4dc9-992d-4de9f53f9cb4","e6ca31dd-2050-4c5b-96a4-0b41077b9ab8","62c793d0-e949-4551-9756-dc7039ee144d","a921d4ed-ab65-4314-a6d8-90cedce03833","bf08d58c-f841-4117-811c-8dc5db14d48a","2bb96483-c17c-462b-b986-bb9b9c45a0ef","24be2b2e-fefa-4123-a7bd-5ddb1aa18a17","fa26cfc1-422f-402b-8ddb-19acff8532a8","747b9623-0ff4-4954-b6a6-1b348e60cc41","3b86ac36-4bef-4ecd-b60a-8dda741fbb31","9d14469a-84cb-410d-b141-00dc42213840"],"settings":{"container":"container","menu":""}}},"order":["main"]}